[
  {
    "id": "skyfox-install-requirements-checklist",
    "title": "Install Requirements Checklist",
    "slug": "install-requirements-checklist",
    "excerpt": "From hardware selection to final torque checks—run this eight-step checklist before anyone clips into a SkyFox swing.",
    "content": "\n      <p>Before the first lift you need absolute confidence in the hardware, the structure, and the flow of the room. Use this checklist to confirm every component meets SkyFox safety specs and that your suite is staged for smooth, weightless play.</p>\n      <h2>1. Confirm Structural Strategy</h2>\n      <ul>\n        <li>Decide on your primary mount: rated ceiling anchors tied into joists or concrete, a SkyFox freestanding frame, or the traveler door kit.</li>\n        <li>Verify load capacity: ceiling structures must handle at least 4× the combined partner weight, frames should sit on level flooring, and doorway trim must be solid wood—not MDF or hollow-core.</li>\n      </ul>\n      <h2>2. Gather Certified Hardware</h2>\n      <ul>\n        <li>SkyFox anchors or frame hardware, factory-rated to 1,000&nbsp;lbs (4.4&nbsp;kN) minimum.</li>\n        <li>SkyFox adjustable suspension straps plus the secondary safety tether.</li>\n        <li>Locking steel carabiners (auto-lock or screw-lock) rated for climbing forces—no decorative clips.</li>\n        <li>Install kit: stud finder, masonry bit or wood bit, impact driver, torque wrench, level, and blue thread-locker.</li>\n      </ul>\n      <h2>3. Map the Space</h2>\n      <ul>\n        <li>Mark a 6 ft / 1.8 m spin radius free of furniture, fixtures, and light cords.</li>\n        <li>Stage landing pads: place a plush rug or crash mat beneath the swing and keep pillows within reach for kneeling landings.</li>\n        <li>Prep ambience: set dimmable lighting, queue the playlist, and position hydration within an arm’s reach of the landing zone.</li>\n      </ul>\n      <h2>4. Locate and Prep Mounting Points</h2>\n      <ul>\n        <li>Ceilings: use a stud finder plus a pilot drill to confirm you’re centered in joists or beam. For concrete, mark and pre-drill to manufacturer depth.</li>\n        <li>Doorways: place the torque strap so the pads hug both sides of the jamb; confirm hinges are tight and latch fully closes.</li>\n        <li>Freestanding frames: extend stabilizer feet, confirm every locking pin is fully seated, and add floor weights if you plan vigorous motion.</li>\n      </ul>\n      <h2>5. Install and Torque Hardware</h2>\n      <ol>\n        <li>Pre-thread bolts with blue thread-locker.</li>\n        <li>Drive hardware to the manufacturer’s torque spec (typically 30–35 ft-lbs for SkyFox anchors). Under- or over-tightening reduces load rating.</li>\n        <li>For frames, torque crossbars and leg bolts, then gently rock the structure to ensure there is zero wobble.</li>\n      </ol>\n      <h2>6. Assemble Suspension</h2>\n      <ul>\n        <li>Attach swivel and primary straps, confirming gate closures on every carabiner.</li>\n        <li>Hook in the secondary safety line to an independent anchor point or the frame’s redundant ring.</li>\n        <li>Set strap lengths to your suite baseline (hips at chair height and shoulders at heart height), then note the adjustments in your install log.</li>\n      </ul>\n      <h2>7. Perform the Anchor Audit</h2>\n      <ol>\n        <li>Hand-check every bolt head or cam lock for movement.</li>\n        <li>Weight-test: apply your full body weight, sway in small circles, and listen for creaks, pops, or flex. If anything shifts, remove load immediately and re-torque.</li>\n        <li>Inspect for gaps between hardware and ceiling/frame surface—there should be zero daylight.</li>\n      </ol>\n      <h2>8. Final Readiness Sweep</h2>\n      <ul>\n        <li>Stage pillows, blankets, and the quick-release tool within arm’s reach.</li>\n        <li>Lay out cleaning wipes, hydration, and aftercare oils on a nearby tray.</li>\n        <li>Do a last visual check: straps untwisted, gates closed, safety line clipped, landing zone clear, lighting and music set.</li>\n      </ul>\n      <p>Once you’ve cleared all eight checkpoints, log the install date, torque values, and photo documentation in your SkyFox maintenance journal. Re-run the audit quarterly—or immediately after any significant scene—to keep every flight silky-smooth and safe.</p>\n    ",
    "category": "Rigging",
    "readTime": "6 min read",
    "featuredImage": "/images/blog/install-requirements.png",
    "status": "ACTIVE",
    "author": "SkyFox Team",
    "publishedAt": "2025-09-20T00:00:00.000Z",
    "createdAt": "2025-09-20T00:00:00.000Z",
    "updatedAt": "2025-09-20T00:00:00.000Z"
  },
  {
    "id": "skyfox-mount-selection-guide",
    "title": "Mount Selection Guide",
    "slug": "mount-selection-guide",
    "excerpt": "Decide between ceiling anchors, freestanding frames, and doorway kits with load specs, install effort, and vibe in mind.",
    "content": "\n      <p>Choosing the right mount is the single biggest factor in how your SkyFox suite feels. Use this guide to evaluate the three signature setups—ceiling anchors, freestanding frames, and the traveler doorway kit—so the hardware, room flow, and care routines match your fantasy.</p>\n      <h2>Ceiling Mount Magic</h2>\n      <ul>\n        <li><strong>Signature vibe:</strong> Seamless, studio-grade installs that disappear into architecture and let you spin 360° without boundaries.</li>\n        <li><strong>Best for:</strong> Dedicated playrooms, high ceilings, concrete lofts, and owners who crave a swing that is always ready.</li>\n        <li><strong>Setup essentials:</strong> Locate joists or beams, pre-drill, and torque SkyFox anchors to spec (30–35 ft-lbs). Pair with the high-capacity swivel and secondary safety line.</li>\n        <li><strong>Watch outs:</strong> Requires permanent hardware and post-scene inspections. Budget for professional install if you’re unsure about structural integrity.</li>\n      </ul>\n      <p><em>Upgrade tip:</em> Add recessed lighting or ceiling medallions to frame the hardware and keep the install stealth.</p>\n      <h2>Freestanding Frame Fluidity</h2>\n      <ul>\n        <li><strong>Signature vibe:</strong> Portable, mid-room suspension with zero drilling. The Nebula frame assembles in minutes and supports full swings, inversions, and partner lifts.</li>\n        <li><strong>Best for:</strong> Renters, multipurpose rooms, patios, or anyone who loves rearranging furniture and traveling with their swing.</li>\n        <li><strong>Setup essentials:</strong> Lock every crossbar pin, check leg spread, and add floor weights or sandbags for high-energy scenes. Place a rug beneath the footprint to protect floors.</li>\n        <li><strong>Watch outs:</strong> Frames need clear ceiling height (8 ft / 2.4 m minimum) and regular bolt torque checks. Store in a dry space to prevent corrosion.</li>\n      </ul>\n      <p><em>Upgrade tip:</em> Clip LED strips or sheer drapery to the top bar for instant theatrical lighting.</p>\n      <h2>Traveler Doorway Kit</h2>\n      <ul>\n        <li><strong>Signature vibe:</strong> Discreet, packable play for hotel suites, guest rooms, and quick-change adventures.</li>\n        <li><strong>Best for:</strong> Explorers who need a stealth rig, renters facing strict drilling policies, or couples who love spontaneous scenes on the road.</li>\n        <li><strong>Setup essentials:</strong> Position the torque strap so the pads hug both sides of the jamb, cinch until the door closes smoothly, and clip in the secondary safety strap to an overhead hinge or alternate anchor.</li>\n        <li><strong>Watch outs:</strong> Only use solid-wood jambs—no hollow-core doors. Monitor load to prevent flex and add foam pads to protect paint.</li>\n      </ul>\n      <p><em>Upgrade tip:</em> Pack a small level and painter’s tape to mark your ideal strap height from one location to the next.</p>\n      <h2>Quick Decision Matrix</h2>\n      <ul>\n        <li><strong>If you want</strong> a permanent, invisible setup for daily play → choose <strong>Ceiling Mount Magic</strong>.</li>\n        <li><strong>If you want</strong> versatility, quick teardown, or outdoor sessions → go with <strong>Freestanding Frame Fluidity</strong>.</li>\n        <li><strong>If you want</strong> carry-on discretion or short-term installs → pack the <strong>Traveler Doorway Kit</strong>.</li>\n      </ul>\n      <h2>Prep Checklist Before Commit</h2>\n      <ul>\n        <li>Measure ceiling height, room width, and door jamb thickness.</li>\n        <li>Log structural details (joist spacing, concrete thickness, door material) in your SkyFox maintenance journal.</li>\n        <li>Confirm you own the necessary tools or book a SkyFox installer.</li>\n        <li>Plan post-scene care—ceiling mounts need quick anchor checks, frames need bolt audits, doorway kits need strap inspections.</li>\n      </ul>\n      <p>Whatever mount you choose, document the install date, torque specs, and photos so future maintenance is effortless. Still undecided? Email <a href=\"mailto:support@skyfoxswings.com\">support@skyfoxswings.com</a> with your room dimensions and fantasy list, and the concierge team will help you pick the suspension path that keeps your suite floating.</p>\n    ",
    "category": "Rigging",
    "readTime": "6 min read",
    "featuredImage": "/images/blog/mount-selection.png",
    "status": "ACTIVE",
    "author": "SkyFox Team",
    "publishedAt": "2025-09-15T00:00:00.000Z",
    "createdAt": "2025-09-15T00:00:00.000Z",
    "updatedAt": "2025-09-15T00:00:00.000Z"
  },
  {
    "id": "skyfox-doorway-safeguards",
    "title": "Doorway Safeguards for Travel",
    "slug": "doorway-safeguards",
    "excerpt": "Travel-friendly installs are easier than ever—follow these safeguards before swinging in a borrowed doorway.",
    "content": "\n      <p>Doorway rigs are iconic for their stealth, but hotel jambs and guest-room trim need extra love before you clip in. Run through these safeguards every time you hang a SkyFox traveler kit so your scene stays smooth, discreet, and damage-free.</p>\n      <h2>1. Pre-Arrival Prep</h2>\n      <ul>\n        <li>Pack the essentials: SkyFox torque strap, secondary safety line, foam pressure pads, painter’s tape, microfiber cloth, and a small bubble level.</li>\n        <li>Confirm the door swings toward you (pull-open) and isn’t hollow-core. Knock on the panel—solid wood sounds dense, hollow doors echo.</li>\n        <li>Check hotel policies; many boutique properties allow swing installs with advance notice if you promise spotless cleanup.</li>\n      </ul>\n      <h2>2. Inspect the Frame</h2>\n      <ul>\n        <li>Look for visible cracks, chipped paint, or flex when you press near the hinges. If you see gaps between jamb and wall, choose a different doorway.</li>\n        <li>Tighten hinge screws with a travel screwdriver. Loose hinges can introduce play that compromises load rating.</li>\n        <li>Do a gentle load test: grip the top of the jamb and apply downward pressure. Any creak or movement means “no go.”</li>\n      </ul>\n      <h2>3. Set the Torque Strap</h2>\n      <ol>\n        <li>Position the strap pads on both sides of the jamb at or slightly above head height.</li>\n        <li>Close the door fully and cinch the strap until the pads hug the trim without crushing it. The door should latch smoothly—if not, adjust height or pressure.</li>\n        <li>Clip the primary carabiners to the strap’s load-rated D-rings, verifying each gate closes automatically.</li>\n      </ol>\n      <h2>4. Distribute the Load</h2>\n      <ul>\n        <li>Slide foam or rubber pads between strap hardware and wood to spread pressure and prevent dents.</li>\n        <li>Hook the secondary safety strap to an overhead hinge, closet rod, or alternate anchor point for redundancy.</li>\n        <li>Limit dynamic swinging—doorway rigs excel at sensual flow and partial lifts, not full aerial spins.</li>\n      </ul>\n      <h2>5. Scene Safety</h2>\n      <ul>\n        <li>Position a mat or folded blanket beneath the swing for soft landings.</li>\n        <li>Keep the quick-release tool on a nearby shelf and review landing cues before lift-off.</li>\n        <li>Monitor the strap tension mid-scene; if anything loosens, pause and re-cinch before continuing.</li>\n      </ul>\n      <h2>6. Micro Aftercare</h2>\n      <ul>\n        <li>Unclip the swing, then slowly release the torque strap to avoid snapping paint or trim.</li>\n        <li>Wipe the jamb with a hotel towel spritzed in toy cleaner or gentle soap water. Dry thoroughly so moisture doesn’t warp wood.</li>\n        <li>Inspect for impressions; if you see marks, warm them with a hairdryer on low and smooth with a microfiber cloth.</li>\n      </ul>\n      <h2>Travel Log Tip</h2>\n      <p>Keep a quick-install log in your SkyFox journal noting hotel name, ideal strap height, and any frame nuances. The next time you visit, you’ll recreate the perfect hang in minutes—and leave the space as immaculate as you found it.</p>\n    ",
    "category": "Rigging",
    "readTime": "5 min read",
    "featuredImage": "/images/blog/doorway-safeguards.png",
    "status": "ACTIVE",
    "author": "SkyFox Team",
    "publishedAt": "2025-09-10T00:00:00.000Z",
    "createdAt": "2025-09-10T00:00:00.000Z",
    "updatedAt": "2025-09-10T00:00:00.000Z"
  },
  {
    "id": "skyfox-pre-flight-safety-check",
    "title": "Pre-Flight Safety Check",
    "slug": "pre-flight-safety-check",
    "excerpt": "Lighting, hardware, and body-ready cues to double-check right before liftoff.",
    "content": "\n      <p>Just before liftoff, slow the energy and treat this checklist as a ritual. It keeps hardware honest, bodies grounded, and your swing ready for whatever choreography follows.</p>\n      <h2>Room Readiness</h2>\n      <ul>\n        <li>Dim lights to a soft amber glow, set perimeter candles or LED strips, and queue a playlist that matches the scene arc.</li>\n        <li>Stage towels, wipes, hydration, and any lube or sensory toys in saddlebags or on a nearby tray so nothing breaks the flow.</li>\n        <li>Clear the landing zone: pillows or crash mats in place, cables tucked away, and a quick-release tool within arm’s reach.</li>\n      </ul>\n      <h2>Hardware Pulse Check</h2>\n      <ul>\n        <li>Run hands along every strap to feel for frays, heat, or grit. Re-seat adjusters so hash marks line up across both sides.</li>\n        <li>Tap each locking carabiner closed, confirm the secondary safety line is clipped, and tug with both hands to test gates.</li>\n        <li>Spin the swivel slowly; if you feel resistance, add a drop of silicone-safe lubricant and wipe away excess.</li>\n      </ul>\n      <h2>Strap &amp; Anchor Verification</h2>\n      <ul>\n        <li>Tighten ceiling bolts or frame pins if you feel any play. Ceiling mounts should sit flush with zero creak.</li>\n        <li>For doorway rigs, re-cinch the torque strap and double-check foam pads are centered to protect trim.</li>\n        <li>Note any adjustments in your maintenance journal so the next flight starts with the same stability.</li>\n      </ul>\n      <h2>Body Prep</h2>\n      <ul>\n        <li>Guide a two-minute mobility warm-up: shoulder rolls, hip circles, and breath work to sync intention.</li>\n        <li>If oils or lotions are on the menu, flip faux fur panels to the smooth side or swap in a spare cover.</li>\n        <li>Review consent cues and landing signals one more time—green, yellow, red, plus any custom gestures.</li>\n      </ul>\n      <p>With lights set, hardware humming, and bodies aligned, take one last shared breath. You’re cleared for lift—log any tweaks afterward so the next session launches just as smoothly.</p>\n    ",
    "category": "Rigging",
    "readTime": "4 min read",
    "featuredImage": "/images/blog/pre-flight-check.png",
    "status": "ACTIVE",
    "author": "SkyFox Team",
    "publishedAt": "2025-09-05T00:00:00.000Z",
    "createdAt": "2025-09-05T00:00:00.000Z",
    "updatedAt": "2025-09-05T00:00:00.000Z"
  },
  {
    "id": "skyfox-cleaning-and-storage-guide",
    "title": "Cleaning & Storage",
    "slug": "cleaning-and-storage-guide",
    "excerpt": "Keep your SkyFox Swing fresh with post-session wipes, weekly washes, and breathable storage routines.",
    "content": "\n      <h2>Quick Answer</h2>\n      <p>Keep your SkyFox Swing fresh by wiping down contact surfaces after every session, laundering removable textiles on a gentle cycle once a week (or sooner after heavy use), inspecting hardware for wear, and storing fabrics completely dry in breathable bags. Suspend or coil rigging neatly, avoid sharp bends, and park the swing in a cool, low-humidity space when it’s off duty.</p>\n      <h2>Cleaning Schedule</h2>\n      <ul>\n        <li>After every session: Air out, wipe, and spot-check.</li>\n        <li>Weekly: Machine- or hand-wash removable covers; sanitize hardware.</li>\n        <li>Quarterly: Full rigging inspection, lubrication of moving metal, and storage refresh.</li>\n      </ul>\n      <h2>Prep Checklist</h2>\n      <p>Mild pH-neutral detergent, enzyme spray, soft microfiber cloths, silicone-safe disinfectant, lint roller, mesh laundry bags, gentle brush, breathable cotton storage bags, desiccant packets (for humid climates).</p>\n      <h2>After Each Session</h2>\n      <ol>\n        <li>Ventilate the area; let the swing hang free for 10 minutes.</li>\n        <li>Brush off lint or debris with a dry microfiber cloth.</li>\n        <li>Wipe touchpoints (seat, straps, buckles) using a lightly damp cloth and silicone-safe disinfectant; avoid soaking memory foam or padding.</li>\n        <li>Check seams, carabiners, and swivel joints for dust or hair that could compromise movement.</li>\n      </ol>\n      <h2>Weekly Deep Clean</h2>\n      <ol>\n        <li>Detach removable fabrics and place them in mesh bags.</li>\n        <li>Wash on cold, delicate cycle with pH-neutral detergent; skip fabric softeners and bleach.</li>\n        <li>For hand-wash-only textiles, soak in lukewarm water, agitate gently, rinse thoroughly.</li>\n        <li>Lay flat or hang-dry away from direct sun or heat vents to preserve elasticity.</li>\n        <li>Once dry, fluff cushioning by hand to restore loft.</li>\n      </ol>\n      <h2>Spot &amp; Stain Strategy</h2>\n      <ul>\n        <li>Fresh spills: Blot (don’t rub) with a dry cloth, then treat with enzyme spray.</li>\n        <li>Oil-based marks: Sprinkle cornstarch for 10 minutes, brush away, then dab with mild detergent solution.</li>\n        <li>Metallic transfer or hardware scuffs: Use a suede eraser or melamine sponge with minimal pressure.</li>\n      </ul>\n      <h2>Hardware Care</h2>\n      <ul>\n        <li>Wipe carabiners, swivels, and anchor plates with a damp cloth; dry fully.</li>\n        <li>Inspect for burrs, rust, or hairline cracks; retire components immediately if compromised.</li>\n        <li>Apply a drop of silicone lubricant to moving joints monthly; wipe excess to prevent drips onto fabric.</li>\n      </ul>\n      <h2>Dry &amp; Reassemble</h2>\n      <p>Ensure every piece—fabrics, foam inserts, straps—is 100% dry before reassembly. Moisture trapped inside padding can breed mildew and odors. Re-thread straps following the original configuration; double-check load-bearing knots and quick-release buckles.</p>\n      <h2>Short-Term Storage (1–7 Days)</h2>\n      <ul>\n        <li>Leave the swing hanging but cover with a breathable dust cover.</li>\n        <li>If you must remove it, coil straps loosely and place textiles in a cotton bag; keep hardware in a separate pouch to prevent snagging.</li>\n      </ul>\n      <h2>Long-Term Storage (Seasonal or Travel)</h2>\n      <ul>\n        <li>Store in a climate-controlled closet between 60–75°F (16–24°C) with humidity under 50%.</li>\n        <li>Use silica gel packets inside storage bags for humid regions.</li>\n        <li>Keep rigging hardware organized in labeled, padded cases to avoid knocks that could weaken structural integrity.</li>\n        <li>Every 60 days, unpack and refold textiles to prevent permanent creasing and check for any latent moisture.</li>\n      </ul>\n      <h2>Common Mistakes to Avoid</h2>\n      <ul>\n        <li>Using harsh cleaners or bleach that degrade UV-treated fibers.</li>\n        <li>Tossing textiles in a hot dryer, which can shrink or weaken webbing.</li>\n        <li>Storing damp fabrics in airtight bins (mold risk).</li>\n        <li>Bending aluminum spreader bars or stands during transport.</li>\n        <li>Ignoring small frays or stitching pops—these can escalate under load.</li>\n      </ul>\n      <h2>When to Contact SkyFox Support</h2>\n      <ul>\n        <li>You notice unusual noises, slipping, or sticking in hardware.</li>\n        <li>Fabrics show thinning spots or load-bearing seams start to separate.</li>\n        <li>You need replacement textiles, upgraded rigging rated for higher loads, or a refresh service package.</li>\n      </ul>\n      <p>Reach the team daily 10 a.m.–10 p.m. ET at support@skyfoxswings.com or 1-833-SKYFOX for tailored guidance.</p>\n      <h2>Next Session Ready</h2>\n      <p>Refresh, inspect, and store your SkyFox Swing with the same care you give every play session. A consistent cleaning and storage routine keeps the swing plush, discreet, and ready when the vibe is right.</p>\n      <p><em>Research note: Online searches did not surface SkyFox-specific cleaning or storage documentation; this guide is based on general best practices for premium suspension gear.</em></p>\n    ",
    "category": "Care",
    "readTime": "6 min read",
    "featuredImage": "/images/blog/cleaning-storage.png",
    "status": "ACTIVE",
    "author": "SkyFox Team",
    "publishedAt": "2025-07-21T00:00:00.000Z",
    "createdAt": "2025-07-21T00:00:00.000Z",
    "updatedAt": "2025-07-21T00:00:00.000Z"
  },
  {
    "id": "skyfox-service-request-roadmap",
    "title": "Service Requests Guide (Email-Only)",
    "slug": "service-request-roadmap",
    "excerpt": "Every SkyFox service request runs through support@skyfoxswings.com—here’s how to prep the perfect email.",
    "content": "\n      <h2>SkyFox Swings currently handles every service request by email.</h2>\n      <p>Gather your install details, document the issue, and message <a href=\"mailto:support@skyfoxswings.com\">support@skyfoxswings.com</a>—one email thread drives the entire repair, maintenance, or upgrade process. Expect an acknowledgement within 2 business hours during the team’s 10 a.m.–10 p.m. Eastern window, a troubleshooting plan inside 24 business hours, and scheduling or part shipment within 3–5 business days.</p>\n      <h2>When to Email Support</h2>\n      <ul>\n        <li>Load-bearing concerns such as frayed webbing, stretched seams, or hardware with rough edges.</li>\n        <li>Motion issues including noisy swivels, uneven swing, or anchors that feel loose.</li>\n        <li>Textile refresh needs: professional cleaning coordination, replacement panels, seasonal fabric swaps.</li>\n        <li>Upgrade requests for stands, lighting, or sensory add-ons that integrate with your existing swing.</li>\n        <li>Concierge install check-ins: verification that planned layouts or rigging changes meet SkyFox specs.</li>\n      </ul>\n      <h2>Prep Checklist Before You Hit Send</h2>\n      <ul>\n        <li>Photos or a short video (15–20 seconds) clearly showing the issue.</li>\n        <li>Your setup facts: ceiling type or stand, install date, anchor map, any third-party hardware.</li>\n        <li>Order reference: order number, SKU, or invoice—anything that ties the swing back to your purchase.</li>\n        <li>Availability windows: two or three time slots for live video walkthroughs or, if needed, on-site technician visits.</li>\n      </ul>\n      <h2>How to Structure the Email</h2>\n      <p><strong>Subject line:</strong> Service Request – [Type] – SFX#[OrderNumber] (e.g., Service Request – Repair – SFX#4821).</p>\n      <ol>\n        <li>Your contact info and preferred reply method.</li>\n        <li>Request type (Repair, Maintenance, Upgrade, or Concierge Install).</li>\n        <li>Summary of the issue plus any immediate safety steps you’ve taken (e.g., “swing currently offline”).</li>\n        <li>Attachments: photos, videos, anchor map, receipts.</li>\n        <li>Desired outcome or questions (replacement parts, inspection, remote coaching).</li>\n      </ol>\n      <h2>Response Timeline Once You Email</h2>\n      <ul>\n        <li><strong>0–2 business hours:</strong> Auto or human acknowledgement with a ticket reference code.</li>\n        <li><strong>Within 24 business hours:</strong> Remote specialist reviews your materials, issues safety guidance if needed, and outlines next steps (DIY fix, replacement part, or technician scheduling).</li>\n        <li><strong>3–5 business days:</strong> Logistics team ships approved parts or confirms on-site/virtual appointment slots.</li>\n        <li><strong>After completion:</strong> You receive a care recap, updated maintenance log suggestions, and future inspection reminders.</li>\n      </ul>\n      <h2>Escalation &amp; Follow-Up</h2>\n      <ul>\n        <li>No separate emergency number exists; the support@skyfoxswings.com inbox is the official escalation path.</li>\n        <li>If something feels urgent (e.g., suspected structural compromise), lead your subject line with <strong>URGENT</strong> and detail any temporary safeguards you’ve applied.</li>\n        <li>If 24 business hours pass without a substantive reply, forward your original email with “Second Request” appended to the subject to bump it in the queue.</li>\n      </ul>\n      <h2>FAQs</h2>\n      <ul>\n        <li><strong>Do I need to box and ship the swing?</strong> Most textile swaps ship to you; rigging issues are handled remotely or via a field technician.</li>\n        <li><strong>Are repairs free?</strong> Warranty-covered fixes and proactive safety inspections are complimentary; out-of-warranty work includes a quote for your approval.</li>\n        <li><strong>Can I install third-party accessories?</strong> Email support first—SkyFox will confirm compatibility or recommend certified alternatives.</li>\n      </ul>\n      <h2>Keep Your Swing Session-Ready</h2>\n      <p>A concise, well-documented email speeds up every service request. Save support@skyfoxswings.com, maintain a running install log, and reach out at the first sign of wear so your SkyFox Swing stays as safe and sumptuous as day one.</p>\n      <p><em>Research note: No public SkyFox service portal or hotline was available; guidance reflects the current email-only workflow paired with best practices for premium suspension gear.</em></p>\n    ",
    "category": "Concierge",
    "readTime": "6 min read",
    "featuredImage": "/images/blog/service-request.png",
    "status": "ACTIVE",
    "author": "SkyFox Team",
    "publishedAt": "2025-06-23T00:00:00.000Z",
    "createdAt": "2025-06-23T00:00:00.000Z",
    "updatedAt": "2025-06-23T00:00:00.000Z"
  },
  {
    "id": "skyfox-warranty-magic",
    "title": "Warranty Magic",
    "slug": "warranty-magic",
    "excerpt": "SkyFox’s two-year, confidence-first warranty—what’s covered, how to activate it, and how to file a claim.",
    "content": "\n      <h2>SkyFox Swings wraps every swing and hardware bundle in a 2-year, confidence-first warranty.</h2>\n      <p>Coverage kicks in from your install date. If a seam pops, a swivel sticks, or an anchor plate shows premature wear within those 24 months, email <a href=\"mailto:support@skyfoxswings.com\">support@skyfoxswings.com</a> and the team will repair, replace, or upgrade the affected component so you can get back to weightless play fast.</p>\n      <h2>Coverage Snapshot</h2>\n      <ul>\n        <li><strong>Eligible products:</strong> SkyFox swing bodies, straps, spreader bars, swivels, anchors, and stands purchased new from SkyFox or authorized partners.</li>\n        <li><strong>Duration:</strong> 2 years from install date (documented via invoice or install log).</li>\n        <li><strong>Remedies:</strong> Replacement parts, professional repair, or credit toward an equivalent product—SkyFox decides the best fix for safety and comfort.</li>\n        <li><strong>Transferability:</strong> Coverage follows the original purchaser; resale handoffs require a fresh safety inspection and written transfer confirmation from SkyFox.</li>\n      </ul>\n      <h2>What’s Covered</h2>\n      <ul>\n        <li>Stitching failures, fabric delamination, or foam compression that happens under normal, load-rated use.</li>\n        <li>Hardware issues such as sticky swivels, misaligned carabiners, or anchor hardware that degrades unexpectedly.</li>\n        <li>Cosmetic faults present on arrival (scuffs, dye variances) reported within 14 calendar days.</li>\n      </ul>\n      <h2>What’s Not Covered</h2>\n      <ul>\n        <li>Damage from exceeding load ratings, ceiling failures, or third-party rigging.</li>\n        <li>Modifications using non-SkyFox hardware or DIY accessories.</li>\n        <li>Wear from improper cleaning, harsh chemicals, or storing the swing damp.</li>\n        <li>Normal aesthetic aging (color fade, minor pile change) after sustained use.</li>\n      </ul>\n      <h2>Register Your Warranty</h2>\n      <p>Send a “Warranty Activation” email within 14 days of install that includes: order number, install date, anchor map or technician invoice, swing model/SKU, and photos of the installed setup. SkyFox confirms activation so future claims move quickly.</p>\n      <h2>How to File a Claim</h2>\n      <ol>\n        <li><strong>Subject line:</strong> Warranty Claim – [Issue] – SFX#[OrderNumber].</li>\n        <li><strong>Body:</strong> contact info, install date, concise issue summary, and confirm the swing is currently offline if safety is in question.</li>\n        <li><strong>Attachments:</strong> high-resolution photos/video, copy of your warranty activation email, and any inspection notes.</li>\n        <li><strong>Availability:</strong> offer two or three time slots for a live video walkthrough if the team needs a closer look.</li>\n        <li><strong>Response timeline:</strong> acknowledgement within 2 business hours (10 a.m.–10 p.m. ET window), action plan inside 24 business hours, with parts shipping or service scheduling in 3–5 business days.</li>\n      </ol>\n      <h2>Keep Coverage Valid</h2>\n      <ul>\n        <li>Stick to SkyFox’s cleaning guide—pH-neutral detergents, air drying, and no abrasive solvents.</li>\n        <li>Log quarterly inspections noting hardware condition and any adjustments.</li>\n        <li>Store documents: invoices, activation confirmation, maintenance notes, and technician reports.</li>\n        <li>Loop in SkyFox before adding stands, sensory modules, or lighting rigs to ensure compatibility.</li>\n      </ul>\n      <h2>FAQ</h2>\n      <ul>\n        <li><strong>Does the warranty restart after a replacement?</strong> Replacement parts carry the remainder of your original 2-year term.</li>\n        <li><strong>Can I buy extended protection?</strong> Email support for current upgrade options; availability may vary by region.</li>\n        <li><strong>What if an installer caused damage?</strong> SkyFox coordinates with certified installers, but third-party errors fall outside warranty scope—file directly with the installer while notifying SkyFox for safety guidance.</li>\n      </ul>\n      <h2>Ready to keep your swing covered?</h2>\n      <p>Activate that two-year warranty the day you install, track your maintenance, and email <a href=\"mailto:support@skyfoxswings.com\">support@skyfoxswings.com</a> at the first sign of trouble—Warranty Magic is all about staying one step ahead of wear so every session feels like the first.</p>\n    ",
    "category": "Concierge",
    "readTime": "6 min read",
    "featuredImage": "/images/blog/warranty-magic.png",
    "status": "ACTIVE",
    "author": "SkyFox Team",
    "publishedAt": "2025-06-16T00:00:00.000Z",
    "createdAt": "2025-06-16T00:00:00.000Z",
    "updatedAt": "2025-06-16T00:00:00.000Z"
  },
  {
    "id": "skyfox-return-policy",
    "title": "Return Policy",
    "slug": "return-policy",
    "excerpt": "SkyFox’s 30-day return window starts at delivery—here’s how to qualify, package, and get your refund quickly.",
    "content": "\n      <h2>SkyFox Swings offers a 30-day return window starting the day your order is delivered.</h2>\n      <p>Email <a href=\"mailto:support@skyfoxswings.com\">support@skyfoxswings.com</a> within that timeframe to request a return authorization; include your order number, the items you’d like to send back, and clear photos of their current condition.</p>\n      <h2>Eligibility</h2>\n      <ul>\n        <li>Swings, hardware, and accessories must be unused, uninstalled, and free of marks or scents.</li>\n        <li>Removable textiles and padding need to stay sealed or, if inspected, carefully repacked.</li>\n      </ul>\n      <h2>Non-returnable</h2>\n      <ul>\n        <li>Custom builds, final-sale textiles, and items showing wear from installation or play can’t be refunded for safety and hygiene reasons.</li>\n      </ul>\n      <h2>Return Process</h2>\n      <ul>\n        <li>After you email, support will reply within 2 business hours (10 a.m.–10 p.m. ET) with an RMA code and packing instructions.</li>\n        <li>Ship the product back within 7 days of receiving the RMA; insure the package and share the tracking number by replying to the same thread.</li>\n      </ul>\n      <h2>Inspection &amp; Refunds</h2>\n      <ul>\n        <li>Once the warehouse confirms everything meets the return criteria, refunds post to your original payment method in 5–7 business days.</li>\n        <li>Opened textiles that can’t be resold may incur a refurbishment fee, which SkyFox itemizes before processing the refund.</li>\n      </ul>\n      <h2>Exchanges &amp; Store Credit</h2>\n      <p>Prefer a different color or upgrade? Mention it in your email—support can reserve replacement items or issue store credit as soon as the return clears inspection.</p>\n      <h2>Need help?</h2>\n      <p>Planning the return shipment or curious whether an item qualifies? Email <a href=\"mailto:support@skyfoxswings.com\">support@skyfoxswings.com</a> with photos and delivery details—the team will guide you through the safest path forward.</p>\n    ",
    "category": "Concierge",
    "readTime": "5 min read",
    "featuredImage": "/images/blog/return-policy.png",
    "status": "ACTIVE",
    "author": "SkyFox Team",
    "publishedAt": "2025-06-09T00:00:00.000Z",
    "createdAt": "2025-06-09T00:00:00.000Z",
    "updatedAt": "2025-06-09T00:00:00.000Z"
  }
]
