[
  {
    "id": "sky-velvet-weightless",
    "title": "How to Stage a Weightless Velvet Halo Suite",
    "slug": "weightless-velvet-halo-suite",
    "excerpt": "Concierge styling tips for lighting, fabrics, and accessories that make your Velvet Halo™ swing the star of the room.",
    "content": "<p>The Velvet Halo™ suspension swing is the heart of many Skywalker suites. To help you create a scene that feels as lush as it looks, our concierge team pulled together their favorite staging notes.</p>\n<h2>Layer in Sensory Textures</h2>\n<p>Mix velvet with satin pillows, faux fur rugs, and breathable cotton throws. Keep your swing covers plush but easy to launder after a long night.</p>\n<h2>Light for Mood and Safety</h2>\n<p>Combine dimmable sconces with our Starlight mood clips. Aim for a soft glow on the swing while leaving anchor hardware visible.</p>\n<h2>Accessorize with Intention</h2>\n<ul><li>CloudNine cushion pack for lumbar and hip support</li><li>Silkbound wrist and ankle cuffs for adventurous play</li><li>Stellar Clean &amp; Care kit staged near the suite for aftercare</li></ul>",
    "category": "Styling",
    "readTime": "4 min read",
    "featuredImage": "/images/blog/kinetic.svg",
    "status": "ACTIVE",
    "author": "Skywalker Concierge",
    "publishedAt": "2025-09-15T00:00:00.000Z",
    "createdAt": "2025-10-01T00:00:00.000Z",
    "updatedAt": "2025-10-01T00:00:00.000Z"
  },
  {
    "id": "sky-install-guide",
    "title": "Ceiling Mount vs. A-Frame: Choosing Your Suspension Anchor",
    "slug": "ceiling-mount-vs-a-frame",
    "excerpt": "We break down the pros, cons, and vibe of every Skywalker mounting option so you can play with confidence.",
    "content": "<p>Every Skywalker swing ships with a concierge walkthrough because the anchor you choose shapes your entire experience.</p>\n<h2>Ceiling Mount</h2>\n<p>Perfect for permanent suites and minimal footprints. Requires joist or beam access. Rated to 600 lb with redundant hardware.</p>\n<h2>Nebula A-Frame</h2>\n<p>Freestanding glam for rentals, studios, and content creators. Collapses in minutes, supports wide strap geometry, and travels discreetly.</p>\n<h2>Doorway Escape Kit</h2>\n<p>No-drill doorway mount for apartments or hotel adventures. Quick install, padded pressure points, and easily stashes under the bed.</p>",
    "category": "Guides",
    "readTime": "6 min read",
    "featuredImage": "/images/blog/bench.svg",
    "status": "ACTIVE",
    "author": "Rigging Collective",
    "publishedAt": "2025-08-22T00:00:00.000Z",
    "createdAt": "2025-10-01T00:00:00.000Z",
    "updatedAt": "2025-10-01T00:00:00.000Z"
  },
  {
    "id": "sky-aftercare",
    "title": "Aftercare Rituals for Suspension Play",
    "slug": "aftercare-rituals-suspension-play",
    "excerpt": "From grounding touch to warm beverages, here’s how our intimacy coaches wind down a floating scene.",
    "content": "<p>Aftercare is the quiet glow after the high. Build time into every session to reconnect, hydrate, and support your bodies.</p>\n<h2>Check In and Ground</h2>\n<p>Use reassuring touch, weighted blankets, and breathwork to help partners land.</p>\n<h2>Soothe the Body</h2>\n<p>Warm towels, magnesium lotion, and herbal tea keep muscles relaxed after floating.</p>\n<h2>Refresh Your Swing</h2>\n<p>Swap covers for the wash, wipe hardware with toy-safe cleaner, and let textiles air dry before storing.</p>",
    "category": "Wellbeing",
    "readTime": "5 min read",
    "featuredImage": "/images/blog/standards.svg",
    "status": "ACTIVE",
    "author": "Intimacy Coach Circle",
    "publishedAt": "2025-07-30T00:00:00.000Z",
    "createdAt": "2025-10-01T00:00:00.000Z",
    "updatedAt": "2025-10-01T00:00:00.000Z"
  }
]